---
title: RelinquishOptions
classe: Autodesk.Revit.DB.RelinquishOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# RelinquishOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean CheckedOutElements { get; set; }` | `relinquishOptions.CheckedOutElements` | Boolean |
| `Boolean FamilyWorksets { get; set; }` | `relinquishOptions.FamilyWorksets` | Boolean |
| `Boolean IsValidObject { get; }` | `relinquishOptions.IsValidObject` | Boolean |
| `Boolean StandardWorksets { get; set; }` | `relinquishOptions.StandardWorksets` | Boolean |
| `Boolean UserWorksets { get; set; }` | `relinquishOptions.UserWorksets` | Boolean |
| `Boolean ViewWorksets { get; set; }` | `relinquishOptions.ViewWorksets` | Boolean |
| `Void Dispose()` | `relinquishOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```